# Используем официальный образ Golang на базе Alpine в качестве базового образа
FROM golang:1.20-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum для загрузки зависимостей
COPY go.mod go.sum ./

# Загружаем зависимости
RUN go mod download

# Копируем весь проект в рабочую директорию
COPY . .

# Собираем приложение внутри контейнера
RUN go build -o main ./cmd/main.go

# Экспонируем порт 8080 для веб-сервера
EXPOSE 8080

# Команда, которая будет выполняться при запуске контейнера
CMD ["./main"]
