# Используем официальный образ Golang в качестве базового образа
FROM golang:latest

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл main.go из локальной директории cmd внутрь контейнера
COPY . .

# Копируем go.mod и go.sum для загрузки зависимостей
COPY go.mod go.sum ./

# Загружаем зависимости
RUN go mod download


# Собираем приложение внутри контейнера
RUN go build -o main .

# Экспонируем порт 8080 для веб-сервера
EXPOSE 8080

# Команда, которая будет выполняться при запуске контейнера
CMD ["./main"]